#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform
module.vpc.data.aws_availability_zones.available: Reading...
module.iam.data.aws_iam_policy_document.ec2_assume_role_policy: Reading...
module.rds.data.aws_region.current: Reading...
module.iam.data.aws_region.current: Reading...
module.iam.data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
module.iam.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.rds.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.iam.data.aws_iam_policy_document.ec2_assume_role_policy: Read complete after 0s [id=2851119427]
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.iam.data.aws_caller_identity.current: Read complete after 0s [id=442042522885]
module.iam.data.aws_iam_policy_document.rds_proxy_assume_role_policy: Reading...
module.iam.data.aws_iam_policy_document.rds_proxy_assume_role_policy: Read complete after 0s [id=2850166910]
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # local_file.rds_config will be created
  + resource "local_file" "rds_config" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./rds.conf"
      + id                   = (known after apply)
    }

  # module.ecr.aws_ecr_repository.node_app will be created
  + resource "aws_ecr_repository" "node_app" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE_WITH_EXCLUSION"
      + name                 = "nodeapp"
      + region               = "us-east-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-ecr-node-app"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-ecr-node-app"
        }

      + image_tag_mutability_exclusion_filter {
          + filter      = "latest*"
          + filter_type = "WILDCARD"
        }
    }

  # module.iam.data.aws_iam_policy_document.ec2_instance_iam_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ec2_instance_iam_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "rds-db:connect",
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:us-east-1:442042522885:parameter/dev/database/*",
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.iam.data.aws_iam_policy_document.rds_proxy_iam_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "rds_proxy_iam_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "rds-db:connect",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.iam.aws_iam_instance_profile.ec2_instance_profile will be created
  + resource "aws_iam_instance_profile" "ec2_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "rds-iam-auth-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "rds-iam-auth-ec2-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.iam.aws_iam_policy.rds_proxy_policy will be created
  + resource "aws_iam_policy" "rds_proxy_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "rds-iam-auth-rds-proxy-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam.aws_iam_policy.ssm_parameter_rds_proxy will be created
  + resource "aws_iam_policy" "ssm_parameter_rds_proxy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "rds-iam-auth-ec2-instance-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam.aws_iam_role.ec2_instance_role will be created
  + resource "aws_iam_role" "ec2_instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "rds-iam-auth-ec2-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-ec2-instance-role"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-ec2-instance-role"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role.rds_proxy_role will be created
  + resource "aws_iam_role" "rds_proxy_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + "aws:SourceAccount" = "442042522885"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "rds.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "rds-iam-auth-rds_proxy-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-rds-proxy-role"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-rds-proxy-role"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.attach_ssm_rds_proxy will be created
  + resource "aws_iam_role_policy_attachment" "attach_ssm_rds_proxy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "rds-iam-auth-ec2-role"
    }

  # module.iam.aws_iam_role_policy_attachment.ec2_container_registry will be created
  + resource "aws_iam_role_policy_attachment" "ec2_container_registry" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "rds-iam-auth-ec2-role"
    }

  # module.iam.aws_iam_role_policy_attachment.ec2_ssm_managed will be created
  + resource "aws_iam_role_policy_attachment" "ec2_ssm_managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "rds-iam-auth-ec2-role"
    }

  # module.iam.aws_iam_role_policy_attachment.rds_proxy_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "rds_proxy_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "rds-iam-auth-rds_proxy-role"
    }

  # module.rds.aws_db_instance.main will be created
  + resource "aws_db_instance" "main" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "node_db"
      + db_subnet_group_name                  = "rds-iam-auth-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + enabled_cloudwatch_logs_exports       = [
          + "audit",
          + "error",
          + "general",
          + "iam-db-auth-error",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.4.7"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = true
      + id                                    = (known after apply)
      + identifier                            = "rds-iam-auth-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + region                                = "us-east-1"
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-db"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-db"
        }
      + timezone                              = (known after apply)
      + upgrade_rollout_order                 = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.rds.aws_db_proxy.devdb_proxy will be created
  + resource "aws_db_proxy" "devdb_proxy" {
      + arn                            = (known after apply)
      + default_auth_scheme            = "IAM_AUTH"
      + endpoint                       = (known after apply)
      + endpoint_network_type          = (known after apply)
      + engine_family                  = "MYSQL"
      + id                             = (known after apply)
      + idle_client_timeout            = (known after apply)
      + name                           = "dev-node-app"
      + region                         = "us-east-1"
      + require_tls                    = true
      + role_arn                       = (known after apply)
      + tags_all                       = (known after apply)
      + target_connection_network_type = (known after apply)
      + vpc_security_group_ids         = (known after apply)
      + vpc_subnet_ids                 = (known after apply)

      + auth {
          + client_password_auth_type = "MYSQL_NATIVE_PASSWORD"
          + description               = "End-to-end IAM auth without Secrets Manager"
          + iam_auth                  = "REQUIRED"
          + secret_arn                = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.rds.aws_db_proxy_default_target_group.main will be created
  + resource "aws_db_proxy_default_target_group" "main" {
      + arn           = (known after apply)
      + db_proxy_name = "dev-node-app"
      + id            = (known after apply)
      + name          = (known after apply)
      + region        = "us-east-1"

      + connection_pool_config {
          + connection_borrow_timeout    = 120
          + max_connections_percent      = 100
          + max_idle_connections_percent = 50
        }
    }

  # module.rds.aws_db_proxy_target.main will be created
  + resource "aws_db_proxy_target" "main" {
      + db_instance_identifier = "rds-iam-auth-db"
      + db_proxy_name          = "dev-node-app"
      + endpoint               = (known after apply)
      + id                     = (known after apply)
      + port                   = (known after apply)
      + rds_resource_id        = (known after apply)
      + region                 = "us-east-1"
      + target_arn             = (known after apply)
      + target_group_name      = (known after apply)
      + tracked_cluster_id     = (known after apply)
      + type                   = (known after apply)
    }

  # module.rds.aws_db_subnet_group.main will be created
  + resource "aws_db_subnet_group" "main" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "rds-iam-auth-db-subnet-group"
      + name_prefix             = (known after apply)
      + region                  = "us-east-1"
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-db-subnet-group"
        }
      + tags_all                = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-db-subnet-group"
        }
      + vpc_id                  = (known after apply)
    }

  # module.rds.aws_ssm_parameter.db_enpoint will be created
  + resource "aws_ssm_parameter" "db_enpoint" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "parameter for dev database endpoint"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dev/database/endpoint"
      + region         = "us-east-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.rds.aws_ssm_parameter.db_name will be created
  + resource "aws_ssm_parameter" "db_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "parameter for dev database name"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dev/database/dbname"
      + region         = "us-east-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.rds.aws_ssm_parameter.db_port will be created
  + resource "aws_ssm_parameter" "db_port" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "parameter for dev database port"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dev/database/port"
      + region         = "us-east-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.rds.aws_ssm_parameter.db_region will be created
  + resource "aws_ssm_parameter" "db_region" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "parameter for dev database region"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dev/database/region"
      + region         = "us-east-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.rds.aws_ssm_parameter.db_username will be created
  + resource "aws_ssm_parameter" "db_username" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "DB user with AWSAuthentication Plugin"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dev/database/username"
      + region         = "us-east-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.security_group.aws_security_group.alb_security_group will be created
  + resource "aws_security_group" "alb_security_group" {
      + arn                    = (known after apply)
      + description            = "Application Load Balancer Security Group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ALB Security Group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "rds-iam-auth-ALB-SG"
        }
      + tags_all               = {
          + "Name" = "rds-iam-auth-ALB-SG"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_group.aws_security_group.cloudshell_sg will be created
  + resource "aws_security_group" "cloudshell_sg" {
      + arn                    = (known after apply)
      + description            = "Allow Egress on port rds_port to RDS instance"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "Cloudshell Security Group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "rds-iam-auth-CS-SG"
        }
      + tags_all               = {
          + "Name" = "rds-iam-auth-CS-SG"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_group.aws_security_group.ec2_instance_sg will be created
  + resource "aws_security_group" "ec2_instance_sg" {
      + arn                    = (known after apply)
      + description            = "EC2 Instance Security Group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "EC2SG"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "rds-iam-auth-EC2SG"
        }
      + tags_all               = {
          + "Name" = "rds-iam-auth-EC2SG"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_group.aws_security_group.rds_proxy_sg will be created
  + resource "aws_security_group" "rds_proxy_sg" {
      + arn                    = (known after apply)
      + description            = "RDS Proxy Security Group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "RDSPROXYSG"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "rds-iam-auth-RDSPROXYSG"
        }
      + tags_all               = {
          + "Name" = "rds-iam-auth-RDSPROXYSG"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_group.aws_security_group.rds_sg will be created
  + resource "aws_security_group" "rds_sg" {
      + arn                    = (known after apply)
      + description            = "RDS Security Group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "RDSSG"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-east-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "rds-iam-auth-RDSSG"
        }
      + tags_all               = {
          + "Name" = "rds-iam-auth-RDSSG"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_group.aws_vpc_security_group_egress_rule.alb_egress_ec2 will be created
  + resource "aws_vpc_security_group_egress_rule" "alb_egress_ec2" {
      + arn                          = (known after apply)
      + description                  = "Allow Outgoing request to EC2 Instance App Port"
      + from_port                    = 3000
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 3000
    }

  # module.security_group.aws_vpc_security_group_egress_rule.cloudshell_egress will be created
  + resource "aws_vpc_security_group_egress_rule" "cloudshell_egress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow Outgoing request to default route"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # module.security_group.aws_vpc_security_group_egress_rule.ec2_egress_rule will be created
  + resource "aws_vpc_security_group_egress_rule" "ec2_egress_rule" {
      + arn                          = (known after apply)
      + description                  = "Allow Outgoing traffic on 3306 to RDS Proxy"
      + from_port                    = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = (known after apply)
    }

  # module.security_group.aws_vpc_security_group_egress_rule.ec2_ssm_egress_rule will be created
  + resource "aws_vpc_security_group_egress_rule" "ec2_ssm_egress_rule" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow Outgoing traffic on HTTPS (443) to SSM"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 443
    }

  # module.security_group.aws_vpc_security_group_egress_rule.proxy_to_rds will be created
  + resource "aws_vpc_security_group_egress_rule" "proxy_to_rds" {
      + arn                          = (known after apply)
      + description                  = "Allow Proxy to communicate with RDS"
      + from_port                    = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = (known after apply)
    }

  # module.security_group.aws_vpc_security_group_ingress_rule.alb_ingress_http will be created
  + resource "aws_vpc_security_group_ingress_rule" "alb_ingress_http" {
      + arn                    = (known after apply)
      + description            = "Allow Incoming request on http port 80"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + prefix_list_id         = (known after apply)
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 80
    }

  # module.security_group.aws_vpc_security_group_ingress_rule.alb_ingress_https will be created
  + resource "aws_vpc_security_group_ingress_rule" "alb_ingress_https" {
      + arn                    = (known after apply)
      + description            = "Allow Incoming request on https port 443"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + prefix_list_id         = (known after apply)
      + region                 = "us-east-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 443
    }

  # module.security_group.aws_vpc_security_group_ingress_rule.ec2_ingress_rule will be created
  + resource "aws_vpc_security_group_ingress_rule" "ec2_ingress_rule" {
      + arn                          = (known after apply)
      + description                  = "Allow Incoming request on 3000 from ALB Security Group"
      + from_port                    = 3000
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 3000
    }

  # module.security_group.aws_vpc_security_group_ingress_rule.rds_cloudshell_ingress will be created
  + resource "aws_vpc_security_group_ingress_rule" "rds_cloudshell_ingress" {
      + arn                          = (known after apply)
      + description                  = "Allow Incoming request on 3306 from Cloudshell"
      + from_port                    = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = (known after apply)
    }

  # module.security_group.aws_vpc_security_group_ingress_rule.rds_ingress_rule will be created
  + resource "aws_vpc_security_group_ingress_rule" "rds_ingress_rule" {
      + arn                          = (known after apply)
      + description                  = "Allow Incoming request on 3306 from RDS Proxy"
      + from_port                    = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = (known after apply)
    }

  # module.security_group.aws_vpc_security_group_ingress_rule.rds_proxy_ingress_rule will be created
  + resource "aws_vpc_security_group_ingress_rule" "rds_proxy_ingress_rule" {
      + arn                          = (known after apply)
      + description                  = "Allow Incoming request on 3306 from EC2 Instance"
      + from_port                    = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + region                       = "us-east-1"
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = (known after apply)
    }

  # module.vpc.aws_ec2_managed_prefix_list.main will be created
  + resource "aws_ec2_managed_prefix_list" "main" {
      + address_family = "IPv4"
      + arn            = (known after apply)
      + id             = (known after apply)
      + max_entries    = 5
      + name           = "Public IPs"
      + owner_id       = (known after apply)
      + region         = "us-east-1"
      + tags           = {
          + "Name" = "rds-iam-auth-my_ips"
        }
      + tags_all       = {
          + "Name" = "rds-iam-auth-my_ips"
        }
      + version        = (known after apply)

      + entry {
          + cidr        = "102.88.112.120/32"
          + description = "Public IP from ARTL"
        }
      + entry {
          + cidr        = "129.222.205.51/32"
          + description = "Public IP from STRLNK"
        }
    }

  # module.vpc.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-1"
      + tags     = {
          + "Name" = "rds-iam-auth-igw"
        }
      + tags_all = {
          + "Name" = "rds-iam-auth-igw"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.main will be created
  + resource "aws_nat_gateway" "main" {
      + association_id                     = (known after apply)
      + auto_provision_zones               = (known after apply)
      + auto_scaling_ips                   = (known after apply)
      + availability_mode                  = "regional"
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "us-east-1"
      + regional_nat_gateway_address       = (known after apply)
      + regional_nat_gateway_auto_mode     = (known after apply)
      + route_table_id                     = (known after apply)
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + tags                               = {
          + "Name" = "rds-iam-auth-nat-gw"
        }
      + tags_all                           = {
          + "Name" = "rds-iam-auth-nat-gw"
        }
      + vpc_id                             = (known after apply)
    }

  # module.vpc.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "rds-iam-auth-private-rt"
        }
      + tags_all         = {
          + "Name" = "rds-iam-auth-private-rt"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-1"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "rds-iam-auth-public-rt"
        }
      + tags_all         = {
          + "Name" = "rds-iam-auth-public-rt"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private["us-east-1a"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private["us-east-1b"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private["us-east-1c"] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public["us-east-1a"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public["us-east-1b"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public["us-east-1c"] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-east-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private["us-east-1a"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.20.48.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-dev-private-us-east-1a"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-dev-private-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private["us-east-1b"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.20.64.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-dev-private-us-east-1b"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-dev-private-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private["us-east-1c"] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.20.80.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-dev-private-us-east-1c"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-dev-private-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public["us-east-1a"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.20.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-dev-public-us-east-1a"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-dev-public-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public["us-east-1b"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.20.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-dev-public-us-east-1b"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-dev-public-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public["us-east-1c"] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.20.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-1"
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-dev-public-us-east-1c"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "rds-iam-auth-dev-public-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.20.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-east-1"
      + tags                                 = {
          + "Name" = "rds-iam-auth-vpc"
        }
      + tags_all                             = {
          + "Name" = "rds-iam-auth-vpc"
        }
    }

Plan: 55 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ec2_security_group       = (known after apply)
  + ecr_repo_name            = "nodeapp"
  + rds_address              = (known after apply)
  + rds_db_secret_name       = (known after apply)
  + rds_dbi                  = (known after apply)
  + rds_master_secret_arn    = (known after apply)
  + rds_proxy_arn            = (known after apply)
  + rds_proxy_endpoint       = (known after apply)
  + rds_proxy_iam_role_arn   = (known after apply)
  + rds_proxy_prx_id         = (known after apply)
  + rds_proxy_security_group = (known after apply)
  + rds_security_group       = (known after apply)
  + repository_url           = (known after apply)
  + secret_name              = (known after apply)
  + vpc_id                   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>
*Pushed by: @seunayolu*